export default function About() {
  return (
    <>
      <h2 className='font-inter mb-4 font-semibold text-white lg:hidden'>
        About
      </h2>
      <div className='flex flex-col gap-6'>
        <p>
          저는 <b>사용자 경험</b>을 최우선으로 생각하는 프론트엔드 개발자입니다.
          단순히 기능을 구현하는 것을 넘어, 사용자의 행동과 니즈를 깊이 이해하고
          최적의 경험을 제공하는 여정을 추구합니다. 직관적이고 쉽게 사용할 수
          있는 인터페이스를 만들기 위해 고민하며, 실제 사용자 입장에서
          자연스럽고 효율적인 경험을 설계하는 데 집중합니다.
        </p>

        <p>
          개발자는 새로운 것을 단순히 만들어내는 사람이 아니라, 기존의 것을
          <b> 새로운 시각으로 해석하고 발전</b>시키는 사람이라고 믿습니다.
          새로운 아이디어를 창출하는 것만큼, 이미 존재하는 것을 개선하고 더 나은
          방향으로 발전시키는 과정에서 큰 가치를 발견합니다. 익숙한 것에 의문을
          던지고, 새로운 관점에서 접근하며, 모든 경험에서 배움을 얻는 태도를
          중요하게 생각합니다.
        </p>

        <p>
          다양한 경험에서 얻은 <b>인사이트</b>는 성장의 밑거름이 되었습니다. 늘
          새로운 시각에서 문제를 바라보고 탐구하며, 더 나은 해결책 을
          모색합니다. 디자인적 감각과 사용자 경험에 대한 깊은 이해는 프론트엔드
          개발자로서 더 완성도 높은 결과를 만들어내는 데 중요한 강점이 됩니다.
        </p>

        <p>
          앞으로도 끊임없이 질문하고 탐구하며, 다양한 경험에서 얻은 통찰을
          바탕으로 사용자에게 더 큰 가치를 제공하는 개발자로 성장해 나가고
          싶습니다. 지속적인 학습과 성장을 통해 사용자 중심의 개발로 더 나은
          디지털 경험을 만들어가는 데 기여하겠습니다.
        </p>
      </div>
    </>
  );
}
